<?php
return [
    /********************************************** start general  *********************************************/
    'add_new'=>'إضافة  ',
    'name_ar' => ' الاسم بالعربية',
  'name_en' => ' الاسم بالانجلزية',
  'name' => ' الاسم ',
  'mobile' => 'الجوال',
  'tel' => 'الهاتف',
  'email' => 'البريد الالكترونى',
  'area' => 'المنطقة',
  'city' => 'المدينة',
  'full_address' => ' العنوان بالكامل',
  'home' => ' الرئيسية ',
  'Arabic'=>'بالعربية',
  'English'=>'بالانجليزية',
  'not_be_delete'=>'لا يمكن حذف العنصر لارتباطه بعناصر اخرى',
  'address_data'=>'بيانات العنوان',
  'main_data'=>'البيانات الأساسية ',
  'price_data'=>'بيانات السعر',
  'img_data'=>'الصورة',
  'hello'=>'مرحبا',
  'profile'=>'الملف الشخصي',
  'change_password_successfully'=>'تم تغير كلمة المرور بنجاح',
  'dashboard'=>'لوحة التحكم',
  'setting'=>'الإعدادات',
  'hi5' => 'هاي فايف',
  'control_panel'=>'لوحة التحكم',
  'hello'=>'مرحبا، ',
  'profile'=>'الملف الشخصي',
  'logout'=>'تسجيل الخروج',
  'add_city'=>'إضافة مدينة',
  'no'=>'رقم',
  'page'=>'صفحة',

     /********************************************** end general  *********************************************/

     /********************************************** start login page  *********************************************/
      'login'=>'تسجيل الدخول',
      'sorry_an_error_in_the_data_entered'=>' عذرا ، خطأ في البيانات المدخلة',
      'sorry_the_account_is_disabled_Please_see_administration'=>'عذرا ، الحساب معطل الرجاء مراجعة الإدارة',

     /********************************************** end  login page  *********************************************/


     /********************************************** start category_product   *********************************************/
     'category_products' => 'تصنيف المنتجات',
     'category_product' => 'تصنيف المنتج',
	 'add_category_products'=>'إضافة تصنيف المنتجات',


    /********************************************** end category_product  *********************************************/

     /********************************************** start Stores   *********************************************/
     'stores' => 'المخازن ',
     'export_excel'=>'تصدير لاكسل',
     'storekeeper'=>' امين المخزن',
     'store' => 'المخزن ',
     'add_storekeeper'=>'إضافة امين المخزن',
	 'add_stores'=>'إضافة مخزن',
	 'edit_store'=>'تعديل المخزن ',



    /********************************************** end Stores  *********************************************/

    /********************************************** start internal_store_movements   *********************************************/
     'internal_store_movements' => 'حركات المخازن الداخلية ',
     'internal_store_movement' => 'حركة المخازن الداخلية ',
     'from' => 'من',
     'to' => 'الى   ',
     'name_store' => ' اسم المخزن',
     'employee' => ' الموظف ',
     'car_number' => ' رقم السيارة ',
     'processors'=>'معالجة',
     'processors_log'=>'سجل المعالجات',
    'old_value'=>'القيمة القديمة',
    'new_value'=>'القيمة الجديدة',
    'filed'=>'الحقل ',
    'store_from'=>'من المخزن',
    'store_to'=>'الى المخزن',
    'driver'=>'السائق',
    'do_you_want_to_create_an_account_for_the_user'=>'هل تريد إنشاء حساب للموظف؟',
    'account_data'=>'بيانات الحساب',
    'receipt'=>'استلام',
    'receipt_successful'=>'تم الاستلام بنجاح',
    'received'=>'تم الاستلام',
    'signature_of_the_sender'=>'توقيع المرسل',
    'signature_of_the_driver'=>'توقيع السائق',
    'signature_of_the_recipient'=>'توقيع المستلم',
    'receipt_bills'=>'فاتورة شراء',
    'add_employee'=>' إضافة موظف',
	'add_internal_store_movement'=>'إضافة حركة مخزن داخلية',
	'edit_internal_store_movement'=>'  معالجة حركة المخزن الداخلية ',





    /********************************************** end internal_store_movements  *********************************************/

    /********************************************** start internal_store_movements   *********************************************/
    'cars' => ' السيارات  ',
    'car' => 'السيارة',
    'car_number' => ' رقم السيارة ',
    'car_type' => ' نوع السيارة  ',
    'car_color' => ' لون السيارة  ',
    'car_driver' => ' سائق السيارة   ',
    'car_manufacturing_year' => 'سنة الصنع',
    'add_cars' => ' إضافة سيارة',
	'add_driver'=>'إضافة سائق',
	'edit_car'=>'تعديل السيارة',


    /********************************************** start internal_store_movements   *********************************************/



    /********************************************** start items  *********************************************/
  'categoties' => 'الاصناف',
  'add_sub_items'=>'إضافة الاصناف الفرعية',
  'items'=>'الاصناف',
  'category_name' => 'اسم الصنف',
  'category_name_ar' => '  اسم الصنف بالعربي ',
  'category_name_en' => '  اسم الصنف بالانجليزية  ',
  'manufacture_company' => ' الشركة المصنعة ',
  'unit' => ' الوحدة ',
  'size' => 'المقاس',
  'link_img' => 'رابط الصورة',
  'img' => ' الصورة',
  'type_category' => 'نوع الصنف ',
  'minimum' => 'الحد الادنى ',
  'pricing_price' => 'سعر التسعيرة',
  'final_price' => ' السعر النهائي ',
  'wholesale_price'=>'سعر الجملة   ',
  'cost_price'=>'سعر التكلفة ',
  'barcode'=>'باركود',
  'edit_sub_item'=>'تعديل الاصناف الفرعية',
  'tax_name'=>'الضريبة',
  'item_no'=>'رقم الصنف',
    'add_items'=>' إضافة صنف جديد',
	'add_unit'=>'إضافة وحدة',
	'add_manufacture_companies'=>'إضافة الشركة المصنعه',
	'edit_item'=>'تعديل الصنف',
	'press_here'=>'اضغط هنا ',

      /********************************************** end category  *********************************************/



      /********************************************** start customer  *********************************************/

      'customers' => 'الزبائن',
      'price_category'=>'تصنيف السعر',
      'delegate'=>'المندوب',
	   'add_customer' => 'إضافة زبون',
	   'add_delegate'=>'إضافة مندوب',
	   'edit_customer' => 'تعديل زبون',


        /********************************************** end customer  *********************************************/


        /********************************************** start form  *********************************************/

        'are_you_sure' => 'هل تريد حذف هذا العنصر ؟',
  'are_you_sure_add' => "هل تريد اضافة هذا العنصر؟",
  'are_you_receipt' => 'هل تريد استلام الطلبية؟',

  'cancel' => 'إخفاء',
  'hide' => 'إخفاء',
  'delete' => 'إلغاء',
  'delete_fail' => 'فشلت العملية',
  'delete_success' => 'تمت العملية بنجاح',
  'edit' => 'تعديل',
  'show' => 'عرض',
  'edit_data' => 'تعديل البيانات',
  'error' => 'حدث خطأ غير معروف، الرجاء المحاولة فيما بعد',
  'none' => 'لم يتم ايجاد اي بيانات',
  'ok' => 'حسنا',
  'save' => 'حفظ',
  'save_fail' => 'فشلت العملية',
  'save_success' => 'تمت العملية بنجاح',
  'update_fail' => 'فشلت العملية',
  'update_success' => 'تمت العملية بنجاح',
  'language_specific' => 'معلومات خاصة باللغة',
  'status'=>'الحالة',
  "active"=>'مفعل',
  "inactive"=>'غير مفعل',
  "error_all_filed_required"=>'جميع الحقول مطلوبة',
  "add_successful"=>'تمت الاضافة بنجاح  ',
  "error_process"=>'حدث خطأ أثناء عملية     ',
  "delete_successful"=>'تمت الحذف بنجاح  ',
  "update_successful"=>'تمت التعديل بنجاح  ',
  'mobile_must_be_unique'=>'الجوال مسجل سابقا',
  'email_must_be_unique'=>'البريد الالكترونى مسجل سابقا',
  'tel_must_be_unique'=>'الهاتف مسجل سابقا',
  'username_must_be_unique'=>'اسم المستخدم مسجل مسبقا',
  'car_number_must_be_unique'=>'رقم السيارة مسجل مسبقا   ',

  'name_required'=>'الاسم مطلوب',
  'constant_type_required'=>' نوع الثابت مطلوب',
  'full_address_required'=>'     حقل العنوان بالكامل مطلوب',
  'area_required'=>' حقل المنطقة مطلوب',

  'mobile_required'=>'حقل الجوال مطلوب',
  'name_ar_required'=>' حقل الاسم مطلوب',
  'city_id_required'=>' حقل المدينة مطلوب',
  'delegate_id_required'=>' حقل المندوب مطلوب',

  'driver_id_required'=>' حقل السائق مطلوب',
  'car_number_required'=>' حقل رقم السيارة مطلوب',
  'tel_required'=>' حقل الهاتف مطلوب',
  'storekeeper_id_required'=>' حقل امين المخزن مطلوب',
  'item_id_required'=>' يرجى تحديد الصنف   ',
  'to_store_id_required'=>' يرجى تحديد المخزن   ',

  'from_store_id_required'=>' يرجى تحديد المخزن   ',
  'car_id_required'=>' يرجى تحديد السيارة   ',
  'date_required'=>' حقل التاريخ مطلوب     ',
  'id_itemsArray_required'=>' يرجى اختيار الاصناف',

  'fullname_required'=>' يرجى ادخال الاسم بالكامل ',
  'email_required'=>' يرجى ادخال البريد الالكترونى ',
  'password_required'=>' يرجى ادخال كلمة المرور ',
  'status_required'=>'يرجى تحديد الحالة',

  'quantity_required'=>'يرجى ادخال الكمية ',
  'store_id_required'=>'يرجى تحديد المخزن',
  'rate_required'=>'يرجى ادخال المعدل',
  'category_id_required'=>'يرجى تحديد التصنيف ',
  'unable_to_delete'=>'لا يمكن الحذف',

  'cost_price_required'=>'يرجى ادخال سعر التكلفة  ',
  'minimum_required'=>'يرجى ادخال الحد الادنى',
  'pricing_price_required'=>'يرجى ادخال سعر التسعيرة',
  'final_price_required'=>'يرجى ادخال السعر النهائي',
  'link_img_required'=>'يرجى ادخال رابط الصورة',
  'img_size'=>'حجم الصورة كبير جدا  ',
  'tax_id_required'=>'يرجى اختيار الضريبة',
  'wholesale_price_required'=>'يرجى ادخال سعر الجملة  ',

  'logo_required'=>'يرجى اختيار الشعار',
  'name_en_required'=>'حقل الاسم باللغة الانجلزية مطللوب',

  'storekeeper_id_unique'=>'لا يمكن ان يكون الموظف امين لاكثر من مخزن',
  'barcode_unique'=>'لا يمكن تكرار البار كود',
  'link_img_not_url'=>'رابط الصورة غير صالح',

  'unit_id_required'=>'يرجى اختيار الوحدة',
  'size_required'=>'يرجى ادخال المقاس ',
  'type_category_id_required'=>'يرجى اختيار نوع الصنف',




    /********************************************** end form  *********************************************/


     /********************************************** start suppliers  *********************************************/
     'suppliers' => 'الموردين',
     'name_suppliers'=>'اسم المورد',
     'supplier' => 'المورد',
	 'add_suppliers'=>'إضافة مورد',
	 'edit_suppliers'=>' تعديل المورد',




     /********************************************** end suppliers  *********************************************/


      /********************************************** start users  *********************************************/

      'users' => 'المستخدمون',
      'user' => 'المستخدم',
      'fullname' => 'الاسم بالكامل',
      'username' => 'اسم المستخدم',
      'password' => 'كلمة السر',
      'confirm_password'=>"تأكيد كلمة السر",
      'change_password' => 'تغيير كلمة السر',
      'permissions' => 'الصلاحيات',
      'phone_no' => 'رقم الجوال',
    /********************************************** start users  *********************************************/



     /********************************************** start system_constants  *********************************************/
     'system_constants' => ' ثوابت النظام ',
     'constant' => 'الثابت ',
     'type' => 'النوع ',
	 'add_system_constants'=>'إضافة ثابت للنظام',
	 'edit_system_constants'=>' تعديل ثابت النظام ',


    /********************************************** end system_constants  *********************************************/


   /********************************************** start employees  *********************************************/
   'employees' => ' الموظفين ',


    /********************************************** end employees  *********************************************/

     /********************************************** start entry_documents  *********************************************/
   'entry_documents' => ' مستند إدخال ',
   'supplier' => ' المورد  ',
   'date' => 'التاريخ',
   'document' => ' البيان  ',
   'item' => 'الصنف',
   'quantity' => ' الكمية  ',
   'price' => ' السعر  ',
   'print_report' => ' طباعة التقرير  ',







   /********************************************** end entry_documents  *********************************************/


    /********************************************** start items_production  *********************************************/
    'items_production' => 'انتاج منتج',
	    'add_item_production' => 'اضافة صنف منتج',
	    'edit_item_production' => 'تعديل صنف منتج',


    /********************************************** end items_production  *********************************************/

    /********************************************** start dismantling_product  *********************************************/
    'dismantling_product' => 'تفكيك المنتج',
    'quantity_not_available'=>'الكمية المطلوب تفكيكها غير متوفرة',
	    'edit_dismantling_product' => ' تعديل تفكيك منتج',


    /********************************************** end dismantling_product  *********************************************/


     /********************************************** start tax category   *********************************************/
     'tax_category' => ' تصنيف الضريبة',
	 'add_tax_category'=>'إضافة تصنيف الضريبة',
	 'edit_tax_category'=>' تعديل تصنيف الضريبة ',

     /********************************************** end dismantling_product  *********************************************/



     /********************************************** start taxes   *********************************************/
     'taxes' => 'الضرائب ',
     'rate' => 'المعدل ',
	 'edit_taxes'=>'تعديل الضريبة',
	 'add_taxes'=>'إضافة ضريبة ',



     /********************************************** end taxes  *********************************************/





     /********************************************** start store_item   *********************************************/
     'store_item' => 'عناصر المخزن ',
     'min_quantity' => 'الحد الادنى   ',
     'max_quantity' => 'الحد الاقصى   ',
     'quantity_data' => 'بيانات الكميات  ',
     'min_quantity_required'=>'يرجى ادخال الحد الادنى',
     'max_quantity_required'=>'يرجى ادخال الحد الاقصى',
     'total_bill'=>'مجموع الفاتورة',
     'print_bill'=>'طباعة الفاتورة',
     'to_item'=>'للصنف',
     'quantity_available'=>'الكمية المتوفرة',
     'the_quantity_entered_is_greater_than_the_maximum'=>'الكمية المدخلة اكبر من الحد الاقصى',
     'the_quantity_entered_is_last_than_the_minimum'=>'الكمية المدخلة اقل من الحد الادنى',
     'and'=>'و',

     /********************************************** end store_item  *********************************************/



     /********************************************** start store_item   *********************************************/
     'store_bills' => 'فاتورة المشتريات  ',
     'statement'=>'البيان',
     'type_bill'=>'نوع الفاتورة',
     'discount'=>'الخصم',
     'total'=>'الاجمالي',
     'must_chosess_last_one_item'=>'يجب على الاقل اختيار عنصر واحد',
     'statement_required'=>'يرجى ادخال البيان ',
     'type_id_required'=>'يرجى تحديد نوع الفاتورة  ',
     'supplier_id_required'=>'يرجى تحديد المورد   ',
     'transaction_type'=>'نوع العملية',
     'num_bills'=>'رقم الفاتورة',
     'num_bills_var_required'=>'يرجى ادخال رقم الفاتورة',
     'with_store' => 'مع مخزن',
     'whitout_store' => 'بدون مخزن',
     'total_sums'=>'إجمالي المبالغ',
     'count_item'=>'عدد الاصناف',
     'element_previously_added'=>'العنصر مضاف سابقا',
     'pdf'=>'pdf',
     'Please_choose_an_item'=>'يرجى اختيار صنف ',
	 'currency_id_required'=>'يرجى تحديد العملة',



     /********************************************** end store_item  *********************************************/

     /********************************************** start setting  *********************************************/
     'logo'=>'الشعار ',
     'company_name_ar'=>'اسم الشركة باللغة العربية',
     'company_name_en'=>'اسم الشركة باللغة الانجليزية',
     'text_report_right'=>'نص التقارير الايمن',
     'text_report_left'=>'نص التقارير الايسر',


     /********************************************** end setting  *********************************************/

     /********************************************** start  report  *********************************************/
     'report'=>'التقارير',
     'all'=>'الكل',
     'search'=>'بحث',
     'type_report'=>'نوع التقرير',
     'store_total_report'=>'إجمالى المخزن',
     'store_movement_report'=>'حركات المخازن',
     'excel_file_cannot_be_issued_you_must_search_first'=>'لا يمكن اصدار ملف اكسل، يجب عليك البحث أولا',
     'card_report'=>'كرت المخزن ',
     'card_report'=>'كرت المخزن ',
     'document_no'=>'رقم المستند',
     'type'=>'النوع',
     'import'=>'وارد',
     'export'=>'صادر',
     'balance'=>'الرصيد',
     'card_store'=>'كرت مخزن',
     'item_movement_and_prices'=>'حركة صنف واسعاره',
	 'previous_balances'=>'الارصدة السابقة',




    /********************************************** end  report  *********************************************/


    /********************************************** start  bills  *********************************************/
    'bills'=>'الفواتير',
    'purchases_bills'=>'فواتير مشتريات',
    'purchase_returns'=>'مردود مشتريات',
    'sales_invoices'=>' فواتير مبيعات',
    'sales_payoff'=>' مردود مبيعات ',
    'sales_invoice'=>'  فاتورة مبيعات',



    /********************************************** end  bils  *********************************************/

    /********************************************** start  sales_invoices  *********************************************/
       'mission'=>'الارسالية',
       'currency'=>'العملة',
       'payment_method'=>'طريقة الدفع',
       'check'=>'شيك',
       'check_no'=>'رقم الشيك',
       'bank_no'=>' البنك',
       'branch_no'=>' الفروع',
       'account_no'=>'رقم الحساب',
       'deserved_date'=>' تاريخ الاستحقاق',
       'check_amount'=>'مبلغ الشيك ',
	   'add_sales_invoices'=>'إضافة فاتورة مبيعات',
	   'name_customer'=>'اسم الزبون',
	   'price_unit'=>'سعر الوحدة',
	   'check_data'=>'بيانات الشيك',
	   'show_check'=>'عرض الشيك',
	   'add_sales_bill'=>'اضافة فاتورة مبيعات',
	   'edit_sales_bill'=>'تعديل فاتورة مبيعات',
	   'add_new_store_bills'=>'  إضافة فاتورة شراء',
       'edit_new_store_bills'=>'  تعديل فاتورة شراء',
       'payment_methods_required'=>'يرجى تحديد طريقة الدفع',
       'mission_required'=>'يرجى ادخال الارسالية',
       'statement_required'=>'يرجى ادخال البيان  ',
       'customer_id_required'=>'يرجى تحديد الزيون   ',
	   'deserved'=>'الاستحقاق',




    /********************************************** end  sales_invoices  *********************************************/

    /********************************************** start  return_on_purchase  *********************************************/
     'add_return_on_purchase'=>'إضافة مردود مشتريات',
     'edit_return_on_purchase'=>' تعديل مردود مشتريات ',

    /********************************************** end  return_on_purchase  *********************************************/

    /********************************************** start  sales_payoff  *********************************************/
     'add_sales_payoff'=>'إضافة مردود مبيعات',
     'edit_sales_payoff'=>' تعديل مردود مبيعات ',

    /********************************************** end  sales_payoff  *********************************************/

    /********************************************** start  banks  *********************************************/
       'banks'=>'البنوك',
	   'accounts'=>'الحسابات',
	   'daily_banking_transactions'=>'معاملات بنكية يومية',
	   'add_accounts'=>'اضافة حساب',
	   	'edit_accounts'=>' تعديل الحساب',
		'account_no'=>'رقم الحساب',
		'IBAN'=>' IBAN',
		'bank_id_required'=>'يرجى اختيار البنك',
		'account_currency_required'=>'  يرجى اختيار عملة الحساب',
		'IBAN_required'=>'  يرجى ادخال IBAN',
	    'account_no_required'=>'يرجى ادخال رقم الحساب',
	    'bank'=>' البنك',
		'account_no_and_curency_un'=>'رقم الحساب والعملة مسجلين سابقا',
		'add_daily_banking_transactions'=>'اضافة معاملة بنكية يومية',
		'edit_daily_banking_transactions'=>'تعديل معاملة بنكية يومية',
		'account'=>'الحساب',
		'account_currency'=>'عملة الحساب',
		'amount'=>'المبلغ',
		'amount_required'=>'يرجى ادخال المبلغ',
		'type_required'=>'يرجى تحديد النوع',
		'account_required'=>'يرجى تحديد الحساب',
		'rate_of_change'=>'معدل التغير',
		'credit'=>'دائن',
		'depit'=>'مدين',
        'movement_type'=>'نوع الحركة',
		'Please_choose_an_account'=>'يرجى اختيار الحساب',
		'bank_account_report'=>'تقرير حساب بنك',
		'account_holder_name'=>'اسم صاحب الحساب',
		'cheques'=>'الشيكات',




    /********************************************** end  banks  *********************************************/


    /********************************************** start Transfer between currencies  *********************************************/
    'transfer_between_currencies'=>'التحويل بين العملات',
    'add_transfer_between_currencies'=>'التحويل بين العملات',
    'edit_transfer_between_currencies'=>'التحويل بين العملات',
    'transfer_currencies_unique'=>'التحويل مسجل مسبقا فقط قم بتغير المعدل ',

    /********************************************** end Transfer between currencies  *********************************************/


    /********************************************** start cheques *********************************************/
     'processing_of_incoming_cheques'=>'معالجة الشيكات الواردة',
     'cancel_cheques'=>'إلغاء شيك',
     'rent_incoming_cheques'=>' تجير شيكات واردة',
     'deposit_cheques'=>'إيداع الشيكات',
     'cashing_deposited_cheques'=>'صرف شيكات المودعة',
     'return_incoming_cheques'=>'ارجاع الشيكات الوادرة',
	 'cancel'=>'الغاء',
	 'are_you_sure_you_want_to_cancel_the_cheques_number'=>'هل انت متأكد من الغاء الشيك رقم ',
       'cheques_canceled'=>'تم الغاء الشيك',
	   'deposit'=>'ايداع',
	   'rent'=>'تجير',
	   'cheques_data'=>'بيانات الشيك',
	   'the_deposit_was_successful'=>'تم الايداع بنجاح',
	   'cashing'=>'صرف',
	   'are_you_sure_you_want_to_cash_the_cheques_number'=>'هل انت متأكد من صرف الشيك رقم',
	   'in_an_amount'=>'بمبلغ',
	   'it_is_the_customer'=>'ومن الزبون',
	   'to_account'=>' الى الحساب',
	   'cash_cheques'=>'صرف شيك',
	   'return'=>'إرجاع',
	   'the_cheques_was_successfully_cashed'=>'تم صرف الشيك بنجاح',
	   'the_check_was_successfully_returned'=>'تم ارجاع الشيك بنجاح',
	   'return_cheques'=>'ارجاع شيك',
	   'are_you_sure_you_want_to_return_the_cheques_number'=>'هل انت متأكد من ارجاع الشيك رقم',
	   'the_return_was_successful'=>'تم الارجاع بنجاح',
	   'the_rent_was_successful'=>'تم التجير بنجاح',

    'Please_log_in'=> 'الرجاء تسجيل دخول',
    'code_invalid'=> 'الكود غير صحيح',
    'Recording' => 'تسجيل صوتي',
    /********************************************** end cheques *********************************************/

];
